import { Course } from '../types/CourseType.ts'

export const courseList: Course[] = [
  {
    id: '1',
    title: 'Основи Програмування',
    description:
      'Вивчення основних концепцій та мов програмування для розробки програмного забезпечення',
    image:
      'https://images.pexels.com/photos/546819/pexels-photo-546819.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2',
    completionPercentage: 0,
    activeLessonId: '1',
    lessons: [
      {
        id: '1',
        isCompleted: false,
        title: 'Вступ до IT-компанії',
        content:
          '<p style="background: red;">Ласкаво просимо до нашої IT-компанії! У цьому уроці ви дізнаєтеся про історію компанії, її місію та основні цінності.</p>'
      },
      {
        id: '2',
        isCompleted: false,
        title: 'Основи Програмування',
        content:
          '<p style="background: red;">У цьому уроці ми розглянемо основні концепції програмування, такі як змінні, умови, цикли та функції.</p>'
      },
      {
        id: '3',
        isCompleted: false,
        title: 'Веб-розробка з HTML та CSS',
        content:
          'Ознайомтесь із створенням веб-сторінок за допомогою HTML для структури та CSS для стилізації.'
      },
      {
        id: '4',
        isCompleted: false,
        title: 'Введення в Git та GitHub',
        content:
          'Навчіться використовувати систему контролю версій Git та спільно працювати над проектами за допомогою GitHub.'
      }
    ]
  },
  {
    id: '2',
    title: 'Основи медицини',
    description: 'Вивчення основних концепцій медицини',
    image:
      'https://images.pexels.com/photos/7615574/pexels-photo-7615574.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2',
    completionPercentage: 0,
    activeLessonId: '1',
    lessons: [
      {
        id: '1',
        isCompleted: false,
        title: 'Введення в Медичну Сферу',
        content:
          "Ласкаво просимо до нашої медичної компанії! У цьому уроці ви дізнаєтеся про нашу місію, цінності та важливість нашої роботи для здоров'я пацієнтів."
      },
      {
        id: '2',
        isCompleted: false,
        title: 'Основи Медичного Діагностикування',
        content:
          'У цьому уроці розглянемо основи медичного діагностикування, включаючи методи вимірювання та інструменти, які використовуються у медичній практиці.'
      },
      {
        id: '3',
        isCompleted: false,
        title: 'Етика та Конфіденційність в Медицині',
        content:
          'Вивчіть етичні аспекти та важливість дотримання конфіденційності у медичній сфері та взаємовідносини з пацієнтами.'
      },
      {
        id: '4',
        isCompleted: false,
        title: "Шляхи розвитку в Медичній Кар'єрі",
        content:
          "Розглянемо різні можливості та шляхи розвитку в медичній кар'єрі, включаючи навчання, спеціалізації та вдосконалення навичок."
      }
    ]
  },
  {
    id: '3',
    title: 'Продажі меблів',
    description: 'Введення в продажі меблів',
    image:
      'https://images.pexels.com/photos/4352247/pexels-photo-4352247.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2',
    completionPercentage: 0,
    activeLessonId: '1',
    lessons: [
      {
        id: '1',
        isCompleted: false,
        title: 'Знайомство з Компанією по Продажу Меблів',
        content:
          'Ласкаво просимо до нашої компанії! Вивчіть історію нашого бренду та основні принципи нашої роботи в сфері продажу меблів.'
      },
      {
        id: '2',
        isCompleted: false,
        title: 'Основи Дизайну та Стилю у Меблевій Галузі',
        content:
          "Розглянемо основні концепції дизайну та стилю, які важливі для продажу меблів. Дізнайтеся, як вибирати меблі для різних інтер'єрів."
      },
      {
        id: '3',
        isCompleted: false,
        title: 'Меблів: Типи та Матеріали',
        content:
          'Ознайомтесь із різними типами меблів та матеріалами, які використовуються при їх виготовленні. Розберімо переваги та недоліки кожного виду.'
      },
      {
        id: '4',
        isCompleted: false,
        title: 'Клієнтський Сервіс та Обслуговування Покупців',
        content:
          'Вивчіть навички ефективного клієнтського обслуговування та техніки взаємодії з покупцями в галузі продажу меблів.'
      },
      {
        id: '5',
        isCompleted: false,
        title: 'Маркетинг у Сфері Меблевих Продажів',
        content:
          'Дізнайтеся, як створювати ефективні маркетингові стратегії та просувати продукцію в сфері меблевих продажів.'
      },
      {
        id: '6',
        isCompleted: false,
        title: 'Управління Продажами та Аналіз Даних',
        content:
          'Розглянемо основні аспекти управління продажами та важливість аналізу даних для підвищення ефективності бізнесу в сфері продажу меблів.'
      }
    ]
  },
  {
    id: '4',
    title: 'Туризм',
    description: 'Введення в туризм',
    image:
      'https://images.pexels.com/photos/1268855/pexels-photo-1268855.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2',
    completionPercentage: 0,
    activeLessonId: '1',
    lessons: [
      {
        id: '1',
        isCompleted: false,
        title: 'Вступ до Туристичної Галузі',
        content:
          'Ласкаво просимо до нашої туристичної компанії! Дізнайтеся про основні аспекти та важливість туристичної галузі для наших клієнтів та бізнесу.'
      },
      {
        id: '2',
        isCompleted: false,
        title: 'Організація Туристичних Маршрутів',
        content:
          'Розглянемо процес планування та організації туристичних маршрутів, враховуючи інтереси та потреби різних типів туристів.'
      },
      {
        id: '3',
        isCompleted: false,
        title: 'Клієнтський Сервіс у Туристичній Галузі',
        content:
          'Навчіться надавати високоякісний клієнтський сервіс та вирішувати проблеми під час подорожей для задоволення наших клієнтів.'
      },
      {
        id: '4',
        isCompleted: false,
        title: 'Маркетинг та Продажі Туристичних Пакетів',
        content:
          'Дізнайтеся про ефективні стратегії маркетингу та продажів туристичних пакетів для привертання нових клієнтів та утримання існуючих.'
      },
      {
        id: '5',
        isCompleted: false,
        title: 'Безпека та Екстрені Ситуації у Туризмі',
        content:
          'Розглянемо питання безпеки під час подорожей та навчимося ефективно реагувати на екстрені ситуації для захисту та комфорту клієнтів.'
      }
    ]
  }
]
